title: Process Injection Initiated By MMC
id: f111c230-e350-4773-ab78-27c4a2c1ef87
status: test
description: |
  This query searches for suspicious behavior initiated by MMC.
  This is done by looking at a number of actions that are commonly associated with process injection.

  Attackers are known to use malicious MSC files to deliver payloads to victims.
  MSC files are Microsoft Management Console (MMC) files that can be used to run administrative tools.
  Attackers can use MSC files to deliver malicious payloads to victims by tricking them into opening the file.
  Since a user is likely to close the MMC console after opening the file, attackers may use process injection to ensure that the malicious code continues to run in the background.
references:
  - https://github.com/FalconForceTeam/FalconFriday/blob/master/Defense%20Evasion/0xFF-0546-Process_Injection_Initiated_By_MMC-Win.md
author:
  - FalconForce
  - Linus
date: 06.06.2024
modified: 06.06.2024
tags:
  - attack.defenseevasion
  - attack.t1218.014
  - attack.t1055
  - falcon.0xFF-0546-Process_Injection_Initiated_By_MMC-Win
logsource:
  product: microsoft defender for endpoint
detection:
  load: low
  kusto: |
    let timeframe = 30d;
    DeviceEvents
    | where ingestion_time() >= ago(timeframe)
    | where InitiatingProcessFileName =~ "mmc.exe"
    // Look for actions associated with process injection.
    | where ActionType in~ ("CreateRemoteThreadApiCall", "MemoryRemoteProtect", "NtAllocateVirtualMemoryRemoteApiCall", "NtMapViewOfSectionRemoteApiCall","ReadProcessMemoryApiCall", "SetThreadContextRemoteApiCall", "QueueUserApcRemoteApiCall")
    | extend ParsedCommandLine=parse_command_line(InitiatingProcessCommandLine, "windows")
    // When a .msc file is opened in MMC, the file path is passed as an argument to MMC.
    // Based on testing this is the first argument in the command line. In some cases a command-line switch /32 is passed as the first argument
    // and the file path is the second argument. This is handled by the iif statement below.
    | extend MscFile=ParsedCommandLine[1]
    | extend MscFile=iif(MscFile startswith "/", ParsedCommandLine[2], MscFile)
    // Begin environment-specific filter.
    // End environment-specific filter.
falsepositives:
  - Some legitimate MMC snap-ins may perform actions that are similar to process injection. These will require additional filtering.
level: medium
