title: Suspicious CPL files
id: 95306021-50bd-472d-b6f5-f25cc1dcbe3c
status: test
description: |
    This detection is aimed at identifying ImageLoad events of .CPL which have a "low reputation". We first compile a list of all distinct hashes of .CPL files loaded. For each file, we check the Microsoft Threat Intel database to understand how often it has been seen before by Microsoft. We set some tresholds for signed and unsigned CPLs. If the file is below the treshold (i.e. 50 and resp. 100 in this case), an alert is triggered.
references:
    - https://github.com/FalconForceTeam/FalconFriday/blob/master/Defense%20Evasion/T1218-WIN-001.md
author:
    - FalconForce
date: 05.06.2024
modified: 05.06.2024
tags:
    - attack.privilege_escalation
    - attack.t1218.002
    - falcon.T1218-WIN-001
logsource:
    product: microsoft defender for endpoint
detection:
    load: low
    kusto: |
      //Fairly accurate. Depends on ATP for "Global Prevalence" to filter out false positives.
      let suspiciousCPLs = DeviceImageLoadEvents
      | where Timestamp > ago(1d)
      | where FileName endswith ".cpl"
      | summarize by SHA1
      | invoke FileProfile(SHA1, 1000)
      | where ((isempty(Signer) or not(IsCertificateValid)) and GlobalPrevalence < 100) or GlobalPrevalence < 50;
      DeviceImageLoadEvents
      | where SHA1 has_any (suspiciousCPLs) and ActionType == "ImageLoaded"
falsepositives:
    - Unknown
level: medium
