title: DLL Side-Loading
id: e773b7fd-9a84-4e36-9f86-a0832b5f1735
status: test
description: |
  We need to identify all DLLs loaded by "high integrity" processes and cross check the DLL paths against FileCreate/FileModify events of the same DLL by a medium integrity process.
  That's in a nutshell today's hunt.  Of course, we need to do some magic to filter out false positives as much as possible.
  So any FileCreate/FileModify done by "NT Authoriy\System" and the "RID 500" users aren't interesting.
  Also, we only want to see the FileCreate/FileModify actions which are performed with a default or limited token elevation.
  If done with a full elevated token, the user is apparently admin already.
author:
  - FalconForce
references:
  - https://github.com/FalconForceTeam/FalconFriday/blob/master/Privilege%20Escalation/T1574-WIN-001.md
date: 2024/07/05
modified: 2024/07/05
tags:
  - attack.privilege_escalation
  - attack.t1574
  - falcon.T1574-WIN-001
logsource:
  product: microsoft defender for identity
detection:
  load: low
  kusto: |
    let imls = materialize(
        DeviceImageLoadEvents
        | where InitiatingProcessIntegrityLevel in ("High", "System") and FileName !endswith ".exe"
        | project FolderPath=tolower(FolderPath), InitiatingProcessFileName, InitiatingProcessIntegrityLevel
        | distinct FolderPath, InitiatingProcessFileName, InitiatingProcessIntegrityLevel
    );
    imls 
    | join (
        DeviceFileEvents 
        | where FolderPath in~ ((imls | project FolderPath)) and ActionType in ("FileCreated", "FileModified") and 
        InitiatingProcessIntegrityLevel !in ("High", "System", "") and InitiatingProcessAccountSid != "S-1-5-18" and 
        InitiatingProcessTokenElevation in ("TokenElevationTypeDefault", "TokenElevationTypeLimited") and InitiatingProcessAccountSid !endswith "-500"
        | extend FolderPath=tolower(FolderPath)
    ) on FolderPath
    | project-away FolderPath1
    | summarize count=count() by FolderPath, InitiatingProcessFileName, InitiatingProcessIntegrityLevel, DeviceName, ActionType, FileName
  falsepositives:
  - Unknown
level: medium
