title: Process Injection with CreateRemoteThread
id: 9f3956fe-168c-49ad-a77a-dc68445b31d8
status: test
description: |
  Process injection is an overarching technique used to execute code in other processes.
  There are a large number of documented approaches to achieve process injection. The more classic approaches for process injection use the CreateRemoteThread API.
  This is also often used by attacker to migrate to different processes.
  Although this API is not considered to be "opsec safe", it's still very often used in attacks by malicious actors as well as some red teams (possible emulating those actors).
author:
  - FalconForce
references:
  - https://github.com/FalconForceTeam/FalconFriday/blob/master/Privilege%20Escalation/T1055-WIN-001.md
date: 2024/07/05
modified: 2024/07/05
tags:
  - attack.privilege_escalation
  - attack.t1055
  - falcon.T1055-WIN-001
logsource:
  product: microsoft defender for identity
detection:
  load: low
  kusto: |
    let suspiciousCRT = DeviceEvents
    | where ActionType =~ "CreateRemoteThreadApiCall" and ProcessId != InitiatingProcessId
    | summarize by InitiatingProcessSHA1
    | invoke FileProfile(InitiatingProcessSHA1, 1000)
    | where GlobalPrevalence < 200 or ((isempty(Signer) or not(IsCertificateValid)) and GlobalPrevalence < 500)
    | summarize by InitiatingProcessSHA1;
    DeviceEvents
    | where ActionType =~ "CreateRemoteThreadApiCall" and ProcessId != InitiatingProcessId and InitiatingProcessSHA1 in (suspiciousCRT)
falsepositives:
  - Unknown
level: medium
