title: Active Directory Data Collection Client Side
id: ce693423-44e3-4d93-84c6-b41eaea114f3
status: test
description: |
  During the reconnaissance phase attackers attempt to enumerate information on the Active Directory structure by using various LDAP-based discovery queries to identify targets for attack.
  Popular tools that perform this type of LDAP-based discovery are Sharphound (part of Bloodhound) and AD Explorer.
references:
  - https://github.com/FalconForceTeam/FalconFriday/blob/master/Discovery/AD_Data_Collection_LDAP_Filter_Client_Side.md
author:
  - FalconForce
date: 06.06.2024
modified: 06.06.2024
tags:
  - attack.discovery
  - attack.t1482
  - attack.t1087
  - attack.t1069
  - attack.t1018
  - attack.t1201
  - attack.t1033
  - falcon.AD_Data_Collection_LDAP_Filter_Client_Side
logsource:
  product: microsoft defender for endpoint
detection:
  load: low
  kusto: |
    let timeframe = 30d;
    let suspect_search_filter=dynamic([
        "objectGUID=*", // AD Explorer IOC
        "(schemaIDGUID=*)", // Sharphound IOC
        "(&(objectclass=computer)(userAccountControl:1.2.840.113556.1.4.803:=8192))" // Sharphound IOC
        "(|(samAccountType=805306368)(samAccountType=805306369)(objectclass=organizationalUnit))", // Sharphound IOC
        "(|(samaccounttype=268435456)(samaccounttype=268435457)(samaccounttype=536870912)(samaccounttype=536870913))", // Sharphound IOC
        "(samAccountType=805306368)(samAccountType=805306369)" // Sharphound IOC
    ]);
    DeviceEvents
    | where ingestion_time() >= ago(timeframe)
    | where ActionType =~ "LdapSearch"
    | where not(InitiatingProcessFolderPath startswith @"c:\program files\azure advanced threat protection sensor\" and InitiatingProcessVersionInfoOriginalFileName == @"Microsoft.Tri.Sensor.exe")
    | extend AdditionalFields=parse_json(AdditionalFields)
    | extend SearchFilter=tostring(AdditionalFields.SearchFilter)
    | where SearchFilter has_any(suspect_search_filter)
    | project-reorder DeviceName, InitiatingProcessFolderPath, SearchFilter, InitiatingProcessCommandLine
falsepositives:
  - None expected
level: medium
