
title: Active Directory Data Collection Server Side
id: bd8868cb-f5a2-4a52-a0b0-0da1bb53af1e
status: test
description: |
  ​This query collects LDAP queries executed on domain controllers monitored by Defender for Identity.
  The filter attributes of these queries are extracted and matched against a list of IOCs obtained from popular reconnaissance tools.
references:
  - https://github.com/FalconForceTeam/FalconFriday/blob/master/Discovery/AD_Data_Collection_LDAP_Filter_Server_Side_MDI.md
author:
  - FalconForce
date: 06.06.2024
modified: 06.06.2024
tags:
  - attack.discovery
  - attack.t1482
  - attack.t1087
  - attack.t1069
  - attack.t1018
  - attack.t1201
  - attack.t1033
  - falcon.AD_Data_Collection_LDAP_Filter_Server_Side_MDI
logsource:
  product: microsoft defender for endpoint
detection:
  load: low
  kusto: |
    let timeframe = 30d;
    let suspect_search_filter=dynamic([
        "objectGUID=*", // AD Explorer IOC
        "(schemaIDGUID=*)", // Sharphound IOC
        "(&(objectclass=computer)(userAccountControl&8192))" // Sharphound IOC
        "(|(samAccountType=805306368)(samAccountType=805306369)(objectclass=organizationalUnit))", // Sharphound IOC
        "(|(samaccounttype=268435456)(samaccounttype=268435457)(samaccounttype=536870912)(samaccounttype=536870913))", // Sharphound IOC
        "(samAccountType=805306368)(samAccountType=805306369)" // Sharphound IOC
    ]);
    IdentityQueryEvents
    | where ingestion_time() >= ago(timeframe)
    | where ActionType =~ "LDAP query"
    | extend Query=replace_string(Query," ","")
    | where Query has_any (suspect_search_filter)
falsepositives:
  - None expected
level: medium
