title: EntraID - Password Spraying
id: 7bbf4613-d70e-4fbe-a587-237cc4e76acd
status: test
description: |
  A password spraying attack is detected, where a single machine has performed a large number of failed login attempts, with a large number of different accounts.
  For each account, the attacker uses just a few attempts to prevent account lockout.
  This query uses the Microsoft Defender for Identity (MDI) data as a datasource for the analysis.
  MDI has it's own password spraying detection, but that's not configurable. This implementation provides three variables to tune to your environment.
references:
  - https://github.com/FalconForceTeam/FalconFriday/blob/master/Initial%20Access/T1110.003-WIN-002.md
author:
  - FalconForce
date: 06.06.2024
modified: 06.06.2024
tags:
  - attack.credentialaccess 
  - attack.t1110.003 
  - falcon.T1110.003-WIN-001
  - falcon.T1110.003-WIN-002
logsource:
  product: microsoft defender for endpoint
detection:
  load: low
  kusto: |
    let thresholdForUniqueFailedAccounts = 20;
    let upperBoundOfFailedLogonsPerAccount = 10;
    let ratioSuccessFailedLogons = 0.5;
    let timeframe = 1d;
    IdentityLogonEvents
    | where Timestamp >= ago(timeframe)
    | summarize SuccessLogonCount = countif(ActionType == "LogonSuccess"), FailedLogonCount = countif(ActionType == "LogonFailed"),
        UniqueAccountFailedLogons=dcountif(AccountUpn, ActionType == "LogonFailed"), FailedAccounts=make_set_if(AccountUpn, ActionType == "LogonFailed"),
        SuccessAccounts=make_set_if(AccountUpn, ActionType == "LogonSuccess"), FirstFailed=minif(Timestamp, ActionType == "LogonFailed"),
        LastFailed=maxif(Timestamp, ActionType == "LogonFailed"), LastTimestamp=arg_max(Timestamp, tostring(ReportId)) by IPAddress, DeviceName //IP address is here the "remote IP" , ie the source of the logon attempt
    | where UniqueAccountFailedLogons > thresholdForUniqueFailedAccounts and SuccessLogonCount*ratioSuccessFailedLogons < FailedLogonCount and UniqueAccountFailedLogons*upperBoundOfFailedLogonsPerAccount > FailedLogonCount 
falsepositives:
  - N/A
level: medium
