title: Password Spraying
id: abe8a8c7-226d-481a-826c-c37d31c89691
status: test
description: |
  A password spraying attack is detected, where a single machine has performed a large number of failed login attempts, with a large number of different accounts.
  For each account, the attacker uses just a few attempts to prevent account lockout. This query uses the DeviceLogonEvents per machine to detect a password spraying attacks.
  The machine against which the password spraying is performed (can be DC, a server or even an endpoint) needs to be enrolled in Microsoft Defender for Endpoint.
references:
  - https://github.com/FalconForceTeam/FalconFriday/blob/master/Initial%20Access/T1110.003-WIN-001.md
author:
  - FalconForce
date: 06.06.2024
modified: 06.06.2024
tags:
  - attack.credentialaccess 
  - attack.t1110.003 
logsource:
  product: microsoft defender for endpoint
detection:
  load: low
  kusto: |
    let thresholdForUniqueFailedAccounts = 20;
    let upperBoundOfFailedLogonsPerAccount = 10;
    let ratioSuccessFailedLogons = 0.5;
    let timeframe = 30d;
    DeviceLogonEvents
    | where Timestamp >= ago(timeframe)
    | where LogonType != "Unlock" and ActionType in ("LogonSuccess", "LogonFailed")
    | where not(isempty( RemoteIP) and isempty( RemoteDeviceName))
    | extend LocalLogon=parse_json(AdditionalFields)
    | where RemoteIPType != "Loopback"
    | summarize SuccessLogonCount = countif(ActionType == "LogonSuccess"), FailedLogonCount = countif(ActionType == "LogonFailed"),
        UniqueAccountFailedLogons=dcountif(AccountName, ActionType == "LogonFailed"), FirstFailed=minif(Timestamp, ActionType == "LogonFailed"),
        LastFailed=maxif(Timestamp, ActionType == "LogonFailed"), LastTimestamp=arg_max(Timestamp, tostring(ReportId)), accounts = make_set(AccountName) by RemoteIP, DeviceName //Remote IP is here the source of the logon attempt.
    | project-rename IPAddress=RemoteIP
    | where UniqueAccountFailedLogons > thresholdForUniqueFailedAccounts and SuccessLogonCount*ratioSuccessFailedLogons < FailedLogonCount and UniqueAccountFailedLogons*upperBoundOfFailedLogonsPerAccount > FailedLogonCount 
falsepositives:
  - N/A
level: medium
